{"blta0c9662bcdc76843":{"title":"Porter Robinson","url":"/artists/porter-robinson","featured_image":null,"tags":[],"locale":"en-us","uid":"blta0c9662bcdc76843","ACL":{},"_version":5,"_in_progress":false,"rte_synopsis":{"type":"doc","uid":"c49e54145a704325a420486326ecb7df","_version":5,"attrs":{},"children":[{"uid":"a6d4f169450f4471aa5e083f8eeca1e0","type":"p","attrs":{},"children":[{"text":"Porter Robinson is an American DJ, singer, songwriter, and record producer known for his innovative and emotionally resonant electronic music. A self-taught musician from a young age, he rose to prominence in the early 2010s as a prodigy of the \"complextro\" subgenre, a style of aggressive, intricate electro-house."}]},{"uid":"1b63369ae9e34d139cf5b30adc4a61a0","type":"p","attrs":{},"children":[{"text":"His career took a significant turn with the release of his debut album, "},{"text":"Worlds","italic":true},{"text":", in 2014. Departing from his earlier, club-focused sound, "},{"text":"Worlds","italic":true},{"text":" was a deeply personal and cinematic album that blended electronic music with indie pop, featuring his own vocals and drawing inspiration from video games and anime. This album was a critical success and cemented his reputation as an artist who prioritizes storytelling and emotional depth over traditional dance music conventions."}]},{"uid":"c98d5d9996bd4b2c8c4830d447cde04d","type":"p","attrs":{},"children":[{"text":"Following "},{"text":"Worlds","italic":true},{"text":", Robinson continued to evolve. In 2016, he collaborated with French producer Madeon on the single \"Shelter\" and a joint tour, which became a fan favorite. He also explored a new creative direction under the alias Virtual Self, which paid homage to early 2000s dance and trance music and earned him a Grammy nomination for the track \"Ghost Voices.\""}]},{"uid":"79fa6d456e8f4db687340ec81b50ecd9","type":"p","attrs":{},"children":[{"text":"His second studio album, "},{"text":"Nurture","italic":true},{"text":" (2021), was a deeply introspective work born from a period of creative struggle and depression. The album features his own vocals prominently and explores themes of self-doubt, creativity, and finding beauty in the everyday. It was widely praised for its sincerity and unique blend of acoustic and electronic elements. Robinson's third album, "},{"text":"Smile! :D","italic":true},{"text":" (2024), represents a further evolution, showcasing a more pop-oriented and high-energy sound."}]},{"uid":"23f8c95e831f4340831a5419e482c42d","type":"p","attrs":{},"children":[{"text":"Beyond his albums, Robinson has cultivated a dedicated fan base through his curated music festival, Second Sky, and virtual festivals like Secret Sky, which bring together a diverse range of artists. His work is celebrated for its emotional honesty, artistic integrity, and ability to create immersive, fantastical worlds for his listeners."}]}]},"publish_details":[{"environment":"blte8d907506a7b1c6e","locale":"en-us","time":"2025-08-19T19:17:05.454Z","user":"blt59b88e181ee8ebd7","version":5}]},"blt664da9ebe7f75292":{"title":"Arctic Monkeys","url":"/artists/arctic-monkeys","featured_image":null,"tags":[],"locale":"en-us","uid":"blt664da9ebe7f75292","ACL":{},"_version":3,"_in_progress":false,"rte_synopsis":{"type":"doc","uid":"d82b1bdcdfe84554813cf8f28b05d90c","_version":3,"attrs":{},"children":[{"uid":"59b85bdffcc7419cb91b783741266131","type":"p","attrs":{},"children":[{"text":"Arctic Monkeys are an English rock band formed in Sheffield in 2002. The band consists of lead singer and guitarist Alex Turner, guitarist Jamie Cook, bassist Nick O'Malley, and drummer Matt Helders. They rose to fame through the innovative use of the internet, becoming one of the first bands to garner a massive following through online platforms like MySpace before releasing any official music."}]},{"uid":"b1a269d65e9b4e1eaabe54126bcd3344","type":"p","attrs":{},"children":[{"text":"Their 2006 debut album, "},{"text":"Whatever People Say I Am, That's What I'm Not","italic":true},{"text":", was a commercial and critical sensation, becoming the fastest-selling debut album in UK chart history at the time. The album, with its sharp, witty lyrics about British youth culture and nightlife, established the band as a major force in the indie rock scene. They quickly followed up with "},{"text":"Favourite Worst Nightmare","italic":true},{"text":" (2007), which continued to showcase their energetic, guitar-driven sound."}]},{"uid":"824401809de84caa8951d18259d3fbe4","type":"p","attrs":{},"children":[{"text":"As their career progressed, Arctic Monkeys began to experiment with their sound. Their third album, "},{"text":"Humbug","italic":true},{"text":" (2009), produced by Josh Homme of Queens of the Stone Age, introduced a heavier, more psychedelic rock influence. This evolution continued with "},{"text":"Suck It and See","italic":true},{"text":" (2011) and reached a new peak with the acclaimed "},{"text":"AM","italic":true},{"text":" (2013), an album that blended stoner rock, R&B, and hip-hop rhythms, becoming their most successful album internationally with hits like \"Do I Wanna Know?\"."}]},{"uid":"dbc4ccb2cfa34a1087d5bbb1425bcb3b","type":"p","attrs":{},"children":[{"text":"The band then took a significant stylistic turn with "},{"text":"Tranquility Base Hotel & Casino","italic":true},{"text":" (2018), a departure from their guitar-heavy sound in favor of a piano-led, lounge-pop, and space-age aesthetic. Their most recent album, "},{"text":"The Car","italic":true},{"text":" (2022), further explored this cinematic, orchestral sound, demonstrating their continuous desire for artistic growth. With multiple Brit Awards and Grammy nominations, Arctic Monkeys have cemented their status as one of the most respected and influential bands of the 21st century."}]}]},"publish_details":[{"environment":"blte8d907506a7b1c6e","locale":"en-us","time":"2025-08-19T16:30:00.005Z","user":"blt59b88e181ee8ebd7","version":3}]},"blt447f0fe4be6fc572":{"title":"Kendrick Lamar","url":"/artists/kendrick-lamar","featured_image":null,"tags":[],"locale":"en-us","uid":"blt447f0fe4be6fc572","ACL":{},"_version":3,"_in_progress":false,"rte_synopsis":{"type":"doc","uid":"09fc223293704caab04f186011eb0197","_version":3,"attrs":{},"children":[{"uid":"caaf24f6549e48e1a0a954fc7b212fcf","type":"p","attrs":{},"children":[{"text":"Kendrick Lamar Duckworth, born in Compton, California, on June 17, 1987, is an acclaimed American rapper, songwriter, and record producer. He is widely considered one of the most influential and skilled artists of his generation, known for his introspective lyrics, socially conscious themes, and innovative musical style."}]},{"uid":"64dd497684bc47c2aced2823a3aac720","type":"p","attrs":{},"children":[{"text":"Lamar began his career under the name K-Dot, releasing several mixtapes that garnered local attention. His breakout moment came with his major-label debut album, "},{"text":"good kid, m.A.A.d city","italic":true},{"text":" (2012), a critically acclaimed concept album that details his teenage experiences in Compton. This was followed by the groundbreaking "},{"text":"To Pimp a Butterfly","italic":true},{"text":" (2015), an album that fused hip-hop with jazz, funk, and soul, and explored themes of race, fame, and identity. It became a cultural touchstone and was celebrated for its musical complexity and political depth."}]},{"uid":"f965dc2743294ef08348d88d97096e09","type":"p","attrs":{},"children":[{"text":"In 2017, Lamar released "},{"text":"DAMN.","italic":true},{"text":", a more accessible yet still deeply complex album that earned him a historic Pulitzer Prize for Music, making him the first non-classical or non-jazz artist to receive the award. His next album, "},{"text":"Mr. Morale & the Big Steppers","italic":true},{"text":" (2022), was a raw and emotionally charged double album that delved into personal trauma and self-analysis."}]},{"uid":"2a3bce3a0dd64e4e92f2a63ae9b08674","type":"p","attrs":{},"children":[{"text":"Lamar's work is characterized by its storytelling, intricate wordplay, and a willingness to confront difficult subjects. He has received numerous awards, including multiple Grammy Awards, and has been praised for his ability to push the boundaries of hip-hop while maintaining a strong connection to its roots. He has also been involved in a high-profile public feud with fellow rapper Drake in 2024, which generated a great deal of media attention and produced several notable diss tracks. Kendrick Lamar's career has cemented his place as a leading figure in modern music, admired for his artistic integrity and profound social commentary."}]}]},"publish_details":[{"environment":"blte8d907506a7b1c6e","locale":"en-us","time":"2025-08-19T16:29:52.102Z","user":"blt59b88e181ee8ebd7","version":3}]}}