{"bltdddf25a3c38ebe74":{"title":"DNA.","url":"/songs/dna","description":"\"DNA\" (stylized as \"DNA.\") is a song by American rapper Kendrick Lamar from his fourth studio album Damn. Despite not being released as a single, the song received support at rhythmic radio after its official music video was released. The second track on the album (thirteenth on the Collector's Edition of Damn), it was written by Lamar, while the production was handled by Mike Will Made It.","lyrics":"[Intro: Geraldo Rivera & Kendrick Lamar]\nThis is why I say that hip-hop has done more damage to young African Americans than racism in recent years\nI got, I got, I got, I got—\nLoyalty, got royalty inside my DNA\nCocaine quarter piece, got war and peace inside my DNA\nI got power, poison, pain and joy inside my DNA\nI got hustle though, ambition, flow inside my DNA\nI was born like this, since one like this, immaculate conception\nI transform like this, perform like this, was Yeshua's new weapon\nI don't contemplate, I meditate, then off your f***in' head\nThis that put-the-kids-to-bed\nThis that I got, I got, I got, I got—\nRealness, I just kill s*** 'cause it's in my DNA\nI got millions, I got riches buildin' in my DNA\nI got dark, I got evil that rot inside my DNA\nI got off, I got troublesome, heart inside my DNA\nI just win again, then win again like Wimbledon, I serve\nYeah, that's him again, the sound of the engine is a blur\nYou see, murder on the news again\nThen see Compton, you see me is a blur\nI got loyalty, got royalty inside my DNA\n(I got, I got, I got, I got)\n\n[Verse 1]\nLook, I was born like this, pedigree on another level\nF*** your pedigree, f*** your pedigree\nAnd I got seniority, 'cause I'm a carrier\nF*** your heritage, paranoid and inherited\nThe wind is tellin' me you're a b**** a**, a b**** a**\nD-N-A, a b**** a**, a b**** a**\nYou ain't s*** without a body on your belt\nYou ain't s*** without a ticket on your plate\nYou ain't sick enough to pull it on yourself\nYou ain't rich enough to hit the lot and skate\nTell me when destruction gonna be my fate\nGonna be your fate, gonna be our faith\nPeace to the world, let it rotate\nSex, money, murder—our DNA\n\n[Bridge]\nI know my creator, I'm a believer\nI know my karma, I'm a deceiver\nI know my enemy, I'm a survivor\nI know my spirit, I'm a believer\nI know my enemy, I'm a believer\nI know my karma, I'm a survivor\nI know my creator, I'm a deceiver\nI know my enemy, I know my karma\n\n[Verse 2]\nDNA\nI was born like this\nSince day one like this\nImmaculate conception\nI was born like this\nSince day one like this\nWith a heart full of terror, a soul full of race\nI know murder, conviction\nBurners, boosters, burglars, ballers, dead, redemption\nScholars, fathers dead with kids\nAnd I know depreciation, dollars, hospital bed, a rival, dead, a suicidal weakness\nI was born like this, since one like this\nWith a heart full of terror, a soul full of race\nYou's a b****, your hormones prolly switch inside your DNA\nProblem is, all that sucker s*** inside your DNA\nDaddy prolly snitched, heritage inside your DNA\nBackbone don't exist, born outside a jellyfish, I gauge\nSee, my pedigree is a whole 'nother breed\nAnd you's a motherf***in' b****\nI got my finger on the mothaf***in' trigger\nAnd I'ma tell you everything and I'ma say it with a passion\nI grew up in a project, roaches and rats\nDope, needles, and pins, I've been in it since an infant\nLife ain't nothin' but a b**** on the rag, I'm the rags-to-riches\nN----, I'm the one, you can't be like this, n----\nN----, I'm the one, I said I'm the one\nA-1, every day, G-O-D, I am the one\nSo you can't be like this, n----\nI'm a savage, I'm an a**, I'm a king\nI'm a stunt, I'm a god, I'm a n----, a b****\nI'm a f**, I'm a thug, I'm a nerd, I'm a b****\nI'm whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nRadio won't play this, they know I'm not a fa-a-ake\nThat's my DNA, I'm not a fa-a-ake\nDon't you tell me what you think of me\nI'm a god, I'm a king, I'm a giant\nYou's a b****, you a dub, you a puppet\nSee, my DNA is not for imitation\nYour DNA an abomination\nThis how it is when you're in the Matrix\nDodgin' bullets, reapin' what you sow\nAnd stackin' up the footage, livin' on the go\nAnd sleepin' in a villa\nSippin' from a Grammy, and walkin' in the buildin'\nDiamond in the ceilin', marble on the floors\nBeach inside the window, peekin' out the window\nBaby in the pool, godfather with the tool\nI don't need a witness, I'ma live in secret\nI'ma die with secrets, my DNA is deep\nAnd I don't give a f*** and I ain't in the streets\nAnd I ain't on the ‘Gram, and I ain't on the beat\nI'm a good man with some bad habits\nI'm a sober man with some bad habits\nI'm a high man with some bad habits\nI'm a proud man with some bad habits\nAnd my DNA is not for imitation\nYour DNA an abomination\nThis how it is when you in the Matrix\nYah!\n\n[Outro: Rick James]\nMary-Anne, ha, ha, ha, ha","reference_album":[{"uid":"blt86cad97b133d9882","_content_type_uid":"album"}],"tags":[],"locale":"en-us","uid":"bltdddf25a3c38ebe74","ACL":{},"_version":2,"_in_progress":false,"publish_details":[{"environment":"blte8d907506a7b1c6e","locale":"en-us","time":"2025-08-11T15:43:07.334Z","user":"blt59b88e181ee8ebd7","version":2}]},"blt428dde435b0510aa":{"title":"ELEMENT.","url":"/songs/element","description":"\"Element\" (stylized as \"ELEMENT.\") is a song by American rapper Kendrick Lamar, from his fourth studio album Damn, released on April 14, 2017. The fourth track on the album (eleventh on the Collector's Edition of Damn), the song was written by Lamar, Sounwave, James Blake, and Ricci Riera and produced by Sounwave, Blake, and Riera, with additional production by Tae Beast and Bēkon. The song charted in multiple countries in 2017.","lyrics":"[Intro: Kid Capri]\nY'all know, what happens on Earth stays on Earth!\nAnd I'm not a prophet, but I'm not a prophet\nThis is my world\n\n[Chorus: Kendrick Lamar & Kid Capri]\nAin't nobody prayin' for me\nY'all know, what happens on Earth stays on Earth\nHere we go\nI don't give a f***, I don't give a f***\nI don't give a, I don't give a, I don't give a f***\nI'm willin' to die for this s***\nI done cried for this s***, might take a life for this s***\nPut the Bible down and go eye for an eye for this s***\nD-O-T, my enemy, won't catch a vibe for this s***, ayy\n\n[Verse 1: Kendrick Lamar]\nD**n, I'm really takin' it there?\nThis is what they want, I'm the one\nI'm willin' to die for this s***\nAyy, I'll take a life for this s***, n----\nWe ain't goin' back and forth, n----\nI'm not a rapper, I'm a rapture\nI'm the one with the final call, and they all fall\nN----s talkin' like they up in the feds, but they ain't at all\nI'm the one that's poppin' off, they don't even know what to call it\nThey just know that I'm the one, I'm the one they can't be against\nIf I gotta slap a p**** a** n----, I'ma make it look sexy\nIf I gotta go hard on a b****, I'ma make it look sexy\nI pull up, hop out, air out, made it look sexy\nThey won't take me out my element\nNah, take me out my element\n\n[Chorus: Kendrick Lamar & Kid Capri]\nAin't nobody prayin' for me\nY'all know, what happens on Earth stays on Earth\nHere we go\nI don't give a f***, I don't give a f***\nI don't give a, I don't give a, I don't give a f***\nI'm willin' to die for this s***\nI done cried for this s***, might take a life for this s***\nPut the Bible down and go eye for an eye for this s***\nD-O-T, my enemy, won't catch a vibe for this s***, ayy\n\n[Verse 2: Kendrick Lamar & Kid Capri]\nJust remember what happens on Earth stays on Earth\nI've been stomped out in front of my mama\nMy daddy said, \"You gotta learn to stand up for yourself\"\nI've been humble for a long time\nBut I'm a b**** a** n---- if I don't get my revenge\nIt's a new level, I'm on a new level\nAll my enemies, I'm on a new level\nI'm a bad motherf***er, I'm a new rebel\nI'ma show you a new level of terror\nIt's a new era of bad b****es and good fellas\nI do it for the culture, n----\nTo let y'all know what a real n---- look like\nI don't do it for the ‘Gram, I do it for Compton\nI'm willin' to die for this s***, on my momma\nN----, I'm the realest n---- after all\nB****, be humble\n\n[Chorus: Kendrick Lamar & Kid Capri]\nAin't nobody prayin' for me\nY'all know, what happens on Earth stays on Earth\nHere we go\nI don't give a f***, I don't give a f***\nI don't give a, I don't give a, I don't give a f***\nI'm willin' to die for this s***\nI done cried for this s***, might take a life for this s***\nPut the Bible down and go eye for an eye for this s***\nD-O-T, my enemy, won't catch a vibe for this s***, ayy\n\n[Outro: James Blake]\nAin't nobody prayin' for me\nAin't nobody prayin' for me\nAin't nobody prayin' for me\nAin't nobody prayin' for me","reference_album":[{"uid":"blt86cad97b133d9882","_content_type_uid":"album"}],"tags":[],"locale":"en-us","uid":"blt428dde435b0510aa","ACL":{},"_version":2,"_in_progress":false,"publish_details":[{"environment":"blte8d907506a7b1c6e","locale":"en-us","time":"2025-08-11T15:42:45.624Z","user":"blt59b88e181ee8ebd7","version":2}]},"bltdd64cdd045876815":{"title":"HUMBLE.","url":"/songs/humble","description":"\"Humble\" (stylized as \"HUMBLE.\") is a song by American rapper Kendrick Lamar. It was released on March 30, 2017, along with its music video, by Top Dawg Entertainment, Aftermath Entertainment and Interscope Records. The song was written by Lamar and producers Mike Will Made It and Pluss. The lyrics are a call to humility. It was provided to rhythmic contemporary radio as the lead single from Lamar's fourth studio album, Damn.","lyrics":"[Intro]\nNobody pray for me\nIt's been that day for me\nWaaaaay (yeah, yeah!)\n\n[Verse 1]\nAyy, I remember syrup sandwiches and crime allowances\nFinesse a n---- with some counterfeits, but now I'm countin' this\nParmesan where my accountant lives; in fact, I'm downin' this\nD'USSÉ with my boo bae tastes like Kool-Aid for the analysts\nGirl, I can buy your a** the world with my paystub\nOoh, that p**** good, won't you sit it on my taste bloods?\nI get way too petty, once you let me do the extras\nPull up on your block, then break it down: we playin' Tetris\nA.M. to the P.M., P.M. to the A.M., funk\nPiss out your per diem, you just gotta hate 'em, funk\nIf I quit your BM, I still ride Mercedes, funk\nIf I quit this season, I still be the greatest, funk\nMy left stroke just went viral\nRight stroke put lil' baby in a spiral\nSoprano C, we like to keep it on a high note\nIt's levels to it, you and I know\n\n[Chorus]\nB****, be humble (hol' up, b****)\nSit down (hol' up, lil', hol' up, lil' b****)\nBe humble (hol' up, b****)\nSit down (hol' up, sit down, lil', sit down, lil' b****)\nBe humble (hol' up, hol' up)\nB****, sit down (hol' up, lil' b****)\nBe humble (hol' up, b****)\nSit down (hol' up, hol' up, hol' up, hol' up)\nBe humble\n\n[Verse 2]\nWho dat n---- thinkin' that he frontin' on Man-Man?\nGet the f*** off my stage, I'm the Sandman\nGet the f*** off my d***, that ain't right\nI make a play f***in' up your whole life\nI'm so f***in' sick and tired of the Photoshop\nShow me somethin' natural like a** with some stretch marks\nStill will take you down right on your mama's couch in Polo socks\nAyy, this s*** way too crazy, ayy, you do not amaze me, ayy\nI blew cool from AC, ayy, Obama just paged me, ayy\nI don't fabricate it, ayy, most of y'all be fakin', ayy\nI stay modest 'bout it, ayy, she elaborate it, ayy\nThis that Grey Poupon, that Evian, that TED Talk, ayy\nWatch my soul speak, you let the meds talk, ayy\nIf I kill a n----, it won't be the alcohol, ayy\nI'm the realest n---- after all\n\n[Chorus]\nB****, be humble (hol' up, b****)\nSit down (hol' up, lil', hol' up, lil' b****)\nBe humble (hol' up, b****)\nSit down (hol' up, sit down, lil', sit down, lil' b****)\nBe humble (hol' up, hol' up)\nB****, sit down (hol' up, lil' b****)\nBe humble (hol' up, b****)\nSit down (hol' up, hol' up, hol' up, hol' up)\nBe humble\n(Hol' up, hol' up, hol' up, hol' up)","reference_album":[{"uid":"blt86cad97b133d9882","_content_type_uid":"album"}],"tags":[],"locale":"en-us","uid":"bltdd64cdd045876815","ACL":{},"_version":1,"_in_progress":false,"publish_details":[{"environment":"blte8d907506a7b1c6e","locale":"en-us","time":"2025-08-11T15:42:31.283Z","user":"blt59b88e181ee8ebd7","version":1}]},"bltf416828f88dcb178":{"title":"Shelter","url":"/songs/shelter","description":"\"Shelter\" is a song by American DJ and record producer Porter Robinson and French DJ and record producer Madeon, released as a single on August 11, 2016. In October 2016, a music video, produced in collaboration with A-1 Pictures, was released.","lyrics":"I could never find the right way to tell you\nHave you noticed I've been gone?\n'Cause I left behind the home that you made me\nBut I will carry it along\n\nAnd it's a long way forward, so trust in me\nI'll give them shelter like you've done for me\nAnd I know, I'm not alone, you'll be watching over us\nUntil you're gone\n\nWhen I'm older, I'll be silent beside you\nI know words won't be enough\nAnd they won't need to know our names or our faces\nBut they will carry on for us\n\nAnd it's a long way forward, so trust in me\nI'll give them shelter like you've done for me\nAnd I know, I'm not alone, you'll be watching over us\nUntil you're gone\n\nOh, it's a long way forward, trust in me\nI'll give them shelter like you've done for me\nAnd I know, I'm not alone, you'll be watching over us\nUntil...","reference_album":[{"uid":"blt9cd195e950b47834","_content_type_uid":"album"}],"tags":[],"locale":"en-us","uid":"bltf416828f88dcb178","ACL":{},"_version":1,"_in_progress":false,"publish_details":[{"environment":"blte8d907506a7b1c6e","locale":"en-us","time":"2025-08-11T15:38:55.423Z","user":"blt59b88e181ee8ebd7","version":1}]}}